//---------------------------------------------------------------------------------------------------------
// ▽ Submarine Mirage Framework for Unity
//		Copyright (c) 2020 夢想海の水底より(from Seabed of Reverie)
//		Released under the MIT License :
//			https://github.com/FromSeabedOfReverie/SubmarineMirageFrameworkForUnity/blob/master/LICENSE
//---------------------------------------------------------------------------------------------------------
namespace SubmarineMirageFramework.Process {
	using UniRx;
	///====================================================================================================
	/// <summary>
	/// ■ 処理を自動更新するインターフェース
	///----------------------------------------------------------------------------------------------------
	///		管理クラスで、リストで更新する為に使用。
	/// </summary>
	///====================================================================================================
	public interface IProcessUpdater : IProcess {
		///------------------------------------------------------------------------------------------------
		/// ● 要素
		///------------------------------------------------------------------------------------------------
		/// <summary>物理更新時のイベント</summary>
		Subject<Unit> _fixedUpdateEvent	{ get; }
		/// <summary>更新時のイベント</summary>
		Subject<Unit> _updateEvent		{ get; }
		/// <summary>遅更新時のイベント</summary>
		Subject<Unit> _lateUpdateEvent	{ get; }
		///------------------------------------------------------------------------------------------------
		/// ● 仮想関数
		///------------------------------------------------------------------------------------------------
		/// <summary>● 更新（物理）</summary>
		void FixedUpdate();
		/// <summary>● 更新</summary>
		void Update();
		/// <summary>● 更新（遅）</summary>
		void LateUpdate();
	}
}