//---------------------------------------------------------------------------------------------------------
// ▽ Submarine Mirage Framework for Unity
//		Copyright (c) 2020 夢想海の水底より(from Seabed of Reverie)
//		Released under the MIT License :
//			https://github.com/FromSeabedOfReverie/SubmarineMirageFrameworkForUnity/blob/master/LICENSE
//---------------------------------------------------------------------------------------------------------
namespace SubmarineMirageFramework.FSM {
	///====================================================================================================
	/// <summary>
	/// ■ 有限状態機械のインタフェース
	///----------------------------------------------------------------------------------------------------
	///		State要素に渡す際、ジェネリッククラスだと安定しない為、基盤インタフェースを作成。
	/// </summary>
	///====================================================================================================
	public interface IFiniteStateMachine {
	}
}