//---------------------------------------------------------------------------------------------------------
// ▽ Submarine Mirage Framework for Unity
//		Copyright (c) 2020 夢想海の水底より(from Seabed of Reverie)
//		Released under the MIT License :
//			https://github.com/FromSeabedOfReverie/SubmarineMirageFrameworkForUnity/blob/master/LICENSE
//---------------------------------------------------------------------------------------------------------
namespace SubmarineMirageFramework.Data {
	using UniRx.Async;
	///====================================================================================================
	/// <summary>
	/// ■ 情報の基盤インターフェース
	///----------------------------------------------------------------------------------------------------
	///		情報の基盤クラスで継承される。
	///		管理クラスに登録時にジェネリックは登録不可の為、このクラスを作成。
	/// </summary>
	///====================================================================================================
	public interface IBaseData {
		///------------------------------------------------------------------------------------------------
		/// ● 要素
		///------------------------------------------------------------------------------------------------
		/// <summary>● 読込</summary>
		UniTask Load();
		/// <summary>● 保存</summary>
		UniTask Save();
	}
}