//---------------------------------------------------------------------------------------------------------
// ▽ Submarine Mirage Framework for Unity
//		Copyright (c) 2020 夢想海の水底より(from Seabed of Reverie)
//		Released under the MIT License :
//			https://github.com/FromSeabedOfReverie/SubmarineMirageFrameworkForUnity/blob/master/LICENSE
//---------------------------------------------------------------------------------------------------------
namespace SubmarineMirageFramework.Data {
	///====================================================================================================
	/// <summary>
	/// ■ 情報管理の基盤インターフェース
	///----------------------------------------------------------------------------------------------------
	///		情報管理の基盤クラスで継承される。
	///		管理クラスに登録時にジェネリックは登録不可の為、このクラスを作成。
	/// </summary>
	///====================================================================================================
	public interface IBaseDataManager : IBaseData {
		///------------------------------------------------------------------------------------------------
		/// ● 要素
		///------------------------------------------------------------------------------------------------
		/// <summary>● 解放</summary>
		void Dispose();
	}
}