//---------------------------------------------------------------------------------------------------------
// ▽ Submarine Mirage Framework for Unity
//		Copyright (c) 2020 夢想海の水底より(from Seabed of Reverie)
//		Released under the MIT License :
//			https://github.com/FromSeabedOfReverie/SubmarineMirageFrameworkForUnity/blob/master/LICENSE
//---------------------------------------------------------------------------------------------------------
namespace SubmarineMirage.FSM {
	///====================================================================================================
	/// <summary>
	/// ■ 有限状態機械の運用者のインタフェース
	///----------------------------------------------------------------------------------------------------
	///		有限状態機械の参照保持の手間を省く為、基盤インタフェースを作成。
	/// </summary>
	///====================================================================================================
	public interface IFiniteStateMachineOwner<TFSM> where TFSM : IFiniteStateMachine {
		///------------------------------------------------------------------------------------------------
		/// ● 要素
		///------------------------------------------------------------------------------------------------
		/// <summary>有限状態機械</summary>
		TFSM _fsm { get; }
	}
}