//---------------------------------------------------------------------------------------------------------
// ▽ Submarine Mirage Framework for Unity
//		Copyright (c) 2020 夢想海の水底より(from Seabed of Reverie)
//		Released under the MIT License :
//			https://github.com/FromSeabedOfReverie/SubmarineMirageFrameworkForUnity/blob/master/LICENSE
//---------------------------------------------------------------------------------------------------------
namespace SubmarineMirage.Extension {
	using UnityEngine.Rendering;
	using UniRx;
	using Singleton;
	///====================================================================================================
	/// <summary>
	/// ■ スプラッシュ画面の拡張クラス
	///----------------------------------------------------------------------------------------------------
	/// </summary>
	///====================================================================================================
	public class SplashScreenExtension : Singleton<SplashScreenExtension> {
		///------------------------------------------------------------------------------------------------
		/// ● 要素
		///------------------------------------------------------------------------------------------------
		/// <summary>スプラッシュ画面が、終了したか？</summary>
		public bool _isFinish { get; private set; }
		///------------------------------------------------------------------------------------------------
		/// <summary>
		/// ● コンストラクタ
		/// </summary>
		///------------------------------------------------------------------------------------------------
		public SplashScreenExtension() {
			// そのまま使うと、スプラッシュ画面が残ったまま、前回入力の値が反映される為、
			// スクリプト実行順序の最後に代入して、タイミングをずらす
			_lateUpdateEvent.Subscribe( _ => _isFinish = SplashScreen.isFinished );
		}
	}
}